{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "needed-glenn",
   "metadata": {},
   "outputs": [],
   "source": [
    "import stellargraph as sg\n",
    "from stellargraph import StellarGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "basic-malta",
   "metadata": {},
   "outputs": [],
   "source": [
    "from stellargraph.mapper import HinSAGELinkGenerator\n",
    "from stellargraph.layer import GCN\n",
    "from sklearn import model_selection\n",
    "from stellargraph.layer import HinSAGE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "bulgarian-livestock",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import py2neo\n",
    "import pandas as pd\n",
    "\n",
    "default_host = os.environ.get(\"STELLARGRAPH_NEO4J_HOST\")\n",
    "\n",
    "# Create the Neo4j Graph database object; the parameters can be edited to specify location and authentication\n",
    "neo4j_graph = py2neo.Graph(host='localhost', port=7687, user='neo4j', password='anis')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "respected-royalty",
   "metadata": {},
   "outputs": [],
   "source": [
    "node_labels = neo4j_graph.run(\n",
    "    \"\"\"\n",
    "MATCH (n) RETURN distinct labels(n)[0] AS nodeLabel\n",
    "    \"\"\"\n",
    ").to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "certified-instruction",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "         nodeLabel\n",
      "0              uid\n",
      "1               ts\n",
      "2        id.orig_h\n",
      "3        id.orig_p\n",
      "4        id.resp_h\n",
      "5        id.resp_p\n",
      "6            proto\n",
      "7         duration\n",
      "8       orig_bytes\n",
      "9       resp_bytes\n",
      "10      conn_state\n",
      "11    missed_bytes\n",
      "12         history\n",
      "13       orig_pkts\n",
      "14   orig_ip_bytes\n",
      "15       resp_pkts\n",
      "16   resp_ip_bytes\n",
      "17  tunnel_parents\n",
      "18           label\n",
      "19  detailed-label\n",
      "20         service\n"
     ]
    }
   ],
   "source": [
    "print(node_labels)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "vulnerable-transformation",
   "metadata": {},
   "outputs": [],
   "source": [
    "nodeDict = {}\n",
    "\n",
    "for idx, row in node_labels.itertuples():\n",
    "    if row == 'uid':\n",
    "        cypherQ = \"MATCH (a:`\" + row + \"`) MATCH (a)-[r1:`label`]->(c) RETURN DISTINCT ID(a) as name, ID(a) as idFeature, case when c.id = 'Malicious' then 1 else 0 end as label\"\n",
    "    else:\n",
    "        cypherQ = \"MATCH (a:`\" + row + \"`) MATCH (n:`uid`)-[r1:`\" + row + \"`]->(a) MATCH(n)-[r2:`label`]->(c) RETURN DISTINCT toInteger(toString(ID(a)) + toString(ID(n))) as name, toInteger(toString(ID(a)) + toString(ID(n))) as idFeature, case when c.id = 'Malicious' then 1 else 0 end as label\"\n",
    "    currNode = neo4j_graph.run(cypherQ).to_data_frame().set_index('name')\n",
    "    nodeDict[f'n_{row}'] = currNode"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "literary-sleeve",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "        idFeature  label\n",
      "name                    \n",
      "315056     315056      1\n",
      "315076     315076      1\n",
      "315082     315082      1\n",
      "315086     315086      1\n",
      "315091     315091      1\n",
      "...           ...    ...\n",
      "472571     472571      1\n",
      "472573     472573      1\n",
      "472575     472575      0\n",
      "472579     472579      1\n",
      "472582     472582      1\n",
      "\n",
      "[50000 rows x 2 columns]\n"
     ]
    }
   ],
   "source": [
    "print(nodeDict['n_uid'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "neural-player",
   "metadata": {},
   "outputs": [],
   "source": [
    "rel_types = neo4j_graph.run(\n",
    "    \"\"\"\n",
    "MATCH ()-[r]->() RETURN distinct type(r)\n",
    "    \"\"\"\n",
    ").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "hybrid-bleeding",
   "metadata": {},
   "outputs": [],
   "source": [
    "edgeDict = {}\n",
    "\n",
    "for idx, row in rel_types.itertuples():\n",
    "    currEdge = neo4j_graph.run(\"MATCH (a)-[r1:`\" + row + \"`]->(b) MATCH (a)-[r2:`label`]->(c) RETURN DISTINCT ID(r1) AS rid, ID(a) as source, toInteger(toString(ID(b)) + toString(ID(a))) as target, case when c.id = 'Malicious' then 1 else 0 end as label\").to_data_frame().set_index('rid')\n",
    "    edgeDict[f'e_{row}'] = currEdge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "coral-crazy",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "         source        target  label\n",
      "rid                                 \n",
      "1620054  315056  315057315056      1\n",
      "1620073  315076  315077315076      1\n",
      "1620089  315082  315083315082      1\n",
      "1620105  315086  315087315086      1\n",
      "1620124  315091  315092315091      1\n",
      "...         ...           ...    ...\n",
      "2429999  472571  472572472571      1\n",
      "2430015  472573  472574472573      1\n",
      "2430031  472575  472576472575      0\n",
      "2430046  472579  472580472579      1\n",
      "2430065  472582  472583472582      1\n",
      "\n",
      "[50000 rows x 3 columns]\n"
     ]
    }
   ],
   "source": [
    "print(edgeDict['e_ts'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "opposed-valve",
   "metadata": {},
   "outputs": [],
   "source": [
    "# for idx, val in enumerate(nodeDict):\n",
    "#     nodeDict[int(idx)] = nodeDict[val]\n",
    "#     del nodeDict[val]\n",
    "    \n",
    "# for idx, val in enumerate(edgeDict):\n",
    "#     edgeDict[int(idx)] = edgeDict[val]\n",
    "#     del edgeDict[val]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "electronic-cleanup",
   "metadata": {},
   "outputs": [],
   "source": [
    "hetereogeneousGraph = StellarGraph(nodeDict, edgeDict, is_directed=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "direct-trouble",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "StellarGraph: Undirected multigraph\n",
      " Nodes: 860027, Edges: 810027\n",
      "\n",
      " Node types:\n",
      "  n_uid: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_uid-e_conn_state->n_conn_state, n_uid-e_detailed-label->n_detailed-label, n_uid-e_duration->n_duration, n_uid-e_history->n_history, n_uid-e_id.orig_h->n_id.orig_h, ... (15 more)\n",
      "  n_tunnel_parents: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_tunnel_parents-e_tunnel_parents->n_uid\n",
      "  n_ts: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_ts-e_ts->n_uid\n",
      "  n_resp_pkts: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_resp_pkts-e_resp_pkts->n_uid\n",
      "  n_resp_ip_bytes: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_resp_ip_bytes-e_resp_ip_bytes->n_uid\n",
      "  n_proto: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_proto-e_proto->n_uid\n",
      "  n_orig_pkts: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_orig_pkts-e_orig_pkts->n_uid\n",
      "  n_orig_ip_bytes: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_orig_ip_bytes-e_orig_ip_bytes->n_uid\n",
      "  n_missed_bytes: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_missed_bytes-e_missed_bytes->n_uid\n",
      "  n_label: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_label-e_label->n_uid\n",
      "  n_id.resp_p: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_id.resp_p-e_id.resp_p->n_uid\n",
      "  n_id.resp_h: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_id.resp_h-e_id.resp_h->n_uid\n",
      "  n_id.orig_p: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_id.orig_p-e_id.orig_p->n_uid\n",
      "  n_id.orig_h: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_id.orig_h-e_id.orig_h->n_uid\n",
      "  n_conn_state: [50000]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_conn_state-e_conn_state->n_uid\n",
      "  n_history: [48733]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_history-e_history->n_uid\n",
      "  n_detailed-label: [27882]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_detailed-label-e_detailed-label->n_uid\n",
      "  n_resp_bytes: [11094]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_resp_bytes-e_resp_bytes->n_uid\n",
      "  n_orig_bytes: [11094]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_orig_bytes-e_orig_bytes->n_uid\n",
      "  n_duration: [11094]\n",
      "    Features: float32 vector, length 2\n",
      "    Edge types: n_duration-e_duration->n_uid\n",
      "  ... (1 more)\n",
      "\n",
      " Edge types:\n",
      "    n_tunnel_parents-e_tunnel_parents->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_ts-e_ts->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_resp_pkts-e_resp_pkts->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_resp_ip_bytes-e_resp_ip_bytes->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_proto-e_proto->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_orig_pkts-e_orig_pkts->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_orig_ip_bytes-e_orig_ip_bytes->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_missed_bytes-e_missed_bytes->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_label-e_label->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_id.resp_p-e_id.resp_p->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_id.resp_h-e_id.resp_h->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_id.orig_p-e_id.orig_p->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_id.orig_h-e_id.orig_h->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_conn_state-e_conn_state->n_uid: [50000]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_history-e_history->n_uid: [48733]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_detailed-label-e_detailed-label->n_uid: [27882]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_resp_bytes-e_resp_bytes->n_uid: [11094]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_orig_bytes-e_orig_bytes->n_uid: [11094]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_duration-e_duration->n_uid: [11094]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n",
      "    n_service-e_service->n_uid: [130]\n",
      "        Weights: all 1 (default)\n",
      "        Features: float32 vector, length 1\n"
     ]
    }
   ],
   "source": [
    "print(hetereogeneousGraph.info())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "vertical-regard",
   "metadata": {},
   "outputs": [],
   "source": [
    "hetereogeneousGraph.check_graph_for_ml(expensive_check=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "imported-african",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "         source        target  label\n",
      "rid                                 \n",
      "1626318  316359  315074316359      1\n",
      "1890497  368732  315105368732      0\n",
      "1653935  321937  315105321937      0\n",
      "2408564  468567  315074468567      1\n",
      "2016523  393361  315074393361      1\n",
      "...         ...           ...    ...\n",
      "1620854  315241  315074315241      1\n",
      "2425588  471745  315074471745      1\n",
      "1819735  354893  315105354893      0\n",
      "1808969  352777  315074352777      1\n",
      "1935704  377586  315105377586      0\n",
      "\n",
      "[35000 rows x 3 columns]\n",
      "         source        target  label\n",
      "rid                                 \n",
      "2349382  457356  315074457356      1\n",
      "2149154  418991  315105418991      0\n",
      "2204764  429670  315105429670      0\n",
      "1925183  375524  315074375524      1\n",
      "1984288  387040  315105387040      0\n",
      "...         ...           ...    ...\n",
      "2325393  452631  315074452631      1\n",
      "2155169  420140  315074420140      1\n",
      "2304498  448674  315074448674      1\n",
      "1913693  373275  315074373275      1\n",
      "1843145  359478  315074359478      1\n",
      "\n",
      "[5000 rows x 3 columns]\n",
      "         source        target  label\n",
      "rid                                 \n",
      "2041953  398350  315074398350      1\n",
      "1954730  381298  315105381298      0\n",
      "2415191  469802  315074469802      1\n",
      "1885136  367695  315074367695      1\n",
      "2253268  438985  315074438985      1\n",
      "...         ...           ...    ...\n",
      "2392426  465500  315074465500      1\n",
      "2014339  392900  315105392900      0\n",
      "1897390  370087  315074370087      1\n",
      "1914881  373503  315074373503      1\n",
      "1799144  350846  315074350846      1\n",
      "\n",
      "[10000 rows x 3 columns]\n"
     ]
    }
   ],
   "source": [
    "#edges_train, edges_test = model_selection.train_test_split(pd.concat(list(edgeDict.values())), train_size=0.7, test_size=0.3)\n",
    "\n",
    "# train: 0.7, val: 0.1, test: 0.2\n",
    "edges_train, edges_test = model_selection.train_test_split(edgeDict['e_label'], train_size=0.8, test_size=0.2)\n",
    "edges_train, edges_val = model_selection.train_test_split(edges_train, train_size=0.875, test_size=0.125)\n",
    "print(edges_train)\n",
    "print(edges_val)\n",
    "print(edges_test)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "public-warner",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pandas(source=408882, target=315105408882)\n"
     ]
    }
   ],
   "source": [
    "edgelist_train = list(edges_train[[\"source\", \"target\"]].itertuples(index=False))#.rename(columns={\"source\":\"uid\", \"target\":\"uid\"}, inplace=False)\n",
    "edgelist_val = list(edges_val[[\"source\", \"target\"]].itertuples(index=False))\n",
    "edgelist_test = list(edges_test[[\"source\", \"target\"]].itertuples(index=False))\n",
    "\n",
    "print(edgelist_train[1000])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "threatened-trace",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pandas(label=0)\n"
     ]
    }
   ],
   "source": [
    "labels_train = list(edges_train[['label']].itertuples(index=False))\n",
    "labels_val = list(edges_val[['label']].itertuples(index=False))\n",
    "labels_test = list(edges_test[['label']].itertuples(index=False))\n",
    "\n",
    "print(labels_train[1000])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "advanced-parker",
   "metadata": {},
   "outputs": [],
   "source": [
    "batch_size = 50\n",
    "num_samples = [8, 8, 8]\n",
    "\n",
    "generator = HinSAGELinkGenerator(hetereogeneousGraph, batch_size, num_samples, head_node_types=['n_uid', 'n_label'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "contemporary-space",
   "metadata": {},
   "outputs": [],
   "source": [
    "train_gen = generator.flow(edgelist_train, labels_train, shuffle=True)\n",
    "val_gen = generator.flow(edgelist_val, labels_val)\n",
    "test_gen = generator.flow(edgelist_test, labels_test)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "further-understanding",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('n_uid',\n",
       "  [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21]),\n",
       " ('n_label', [22]),\n",
       " ('n_conn_state', [23]),\n",
       " ('n_detailed-label', [24]),\n",
       " ('n_duration', [25]),\n",
       " ('n_history', [26]),\n",
       " ('n_id.orig_h', [27]),\n",
       " ('n_id.orig_p', [28]),\n",
       " ('n_id.resp_h', [29]),\n",
       " ('n_id.resp_p', [30]),\n",
       " ('n_label', [31]),\n",
       " ('n_missed_bytes', [32]),\n",
       " ('n_orig_bytes', [33]),\n",
       " ('n_orig_ip_bytes', [34]),\n",
       " ('n_orig_pkts', [35]),\n",
       " ('n_proto', [36]),\n",
       " ('n_resp_bytes', [37]),\n",
       " ('n_resp_ip_bytes', [38]),\n",
       " ('n_resp_pkts', [39]),\n",
       " ('n_service', [40]),\n",
       " ('n_ts', [41]),\n",
       " ('n_tunnel_parents', [42]),\n",
       " ('n_uid',\n",
       "  [43,\n",
       "   44,\n",
       "   45,\n",
       "   46,\n",
       "   47,\n",
       "   48,\n",
       "   49,\n",
       "   50,\n",
       "   51,\n",
       "   52,\n",
       "   53,\n",
       "   54,\n",
       "   55,\n",
       "   56,\n",
       "   57,\n",
       "   58,\n",
       "   59,\n",
       "   60,\n",
       "   61,\n",
       "   62]),\n",
       " ('n_uid',\n",
       "  [63,\n",
       "   64,\n",
       "   65,\n",
       "   66,\n",
       "   67,\n",
       "   68,\n",
       "   69,\n",
       "   70,\n",
       "   71,\n",
       "   72,\n",
       "   73,\n",
       "   74,\n",
       "   75,\n",
       "   76,\n",
       "   77,\n",
       "   78,\n",
       "   79,\n",
       "   80,\n",
       "   81,\n",
       "   82]),\n",
       " ('n_uid',\n",
       "  [83,\n",
       "   84,\n",
       "   85,\n",
       "   86,\n",
       "   87,\n",
       "   88,\n",
       "   89,\n",
       "   90,\n",
       "   91,\n",
       "   92,\n",
       "   93,\n",
       "   94,\n",
       "   95,\n",
       "   96,\n",
       "   97,\n",
       "   98,\n",
       "   99,\n",
       "   100,\n",
       "   101,\n",
       "   102]),\n",
       " ('n_uid',\n",
       "  [103,\n",
       "   104,\n",
       "   105,\n",
       "   106,\n",
       "   107,\n",
       "   108,\n",
       "   109,\n",
       "   110,\n",
       "   111,\n",
       "   112,\n",
       "   113,\n",
       "   114,\n",
       "   115,\n",
       "   116,\n",
       "   117,\n",
       "   118,\n",
       "   119,\n",
       "   120,\n",
       "   121,\n",
       "   122]),\n",
       " ('n_uid',\n",
       "  [123,\n",
       "   124,\n",
       "   125,\n",
       "   126,\n",
       "   127,\n",
       "   128,\n",
       "   129,\n",
       "   130,\n",
       "   131,\n",
       "   132,\n",
       "   133,\n",
       "   134,\n",
       "   135,\n",
       "   136,\n",
       "   137,\n",
       "   138,\n",
       "   139,\n",
       "   140,\n",
       "   141,\n",
       "   142]),\n",
       " ('n_uid',\n",
       "  [143,\n",
       "   144,\n",
       "   145,\n",
       "   146,\n",
       "   147,\n",
       "   148,\n",
       "   149,\n",
       "   150,\n",
       "   151,\n",
       "   152,\n",
       "   153,\n",
       "   154,\n",
       "   155,\n",
       "   156,\n",
       "   157,\n",
       "   158,\n",
       "   159,\n",
       "   160,\n",
       "   161,\n",
       "   162]),\n",
       " ('n_uid',\n",
       "  [163,\n",
       "   164,\n",
       "   165,\n",
       "   166,\n",
       "   167,\n",
       "   168,\n",
       "   169,\n",
       "   170,\n",
       "   171,\n",
       "   172,\n",
       "   173,\n",
       "   174,\n",
       "   175,\n",
       "   176,\n",
       "   177,\n",
       "   178,\n",
       "   179,\n",
       "   180,\n",
       "   181,\n",
       "   182]),\n",
       " ('n_uid',\n",
       "  [183,\n",
       "   184,\n",
       "   185,\n",
       "   186,\n",
       "   187,\n",
       "   188,\n",
       "   189,\n",
       "   190,\n",
       "   191,\n",
       "   192,\n",
       "   193,\n",
       "   194,\n",
       "   195,\n",
       "   196,\n",
       "   197,\n",
       "   198,\n",
       "   199,\n",
       "   200,\n",
       "   201,\n",
       "   202]),\n",
       " ('n_uid',\n",
       "  [203,\n",
       "   204,\n",
       "   205,\n",
       "   206,\n",
       "   207,\n",
       "   208,\n",
       "   209,\n",
       "   210,\n",
       "   211,\n",
       "   212,\n",
       "   213,\n",
       "   214,\n",
       "   215,\n",
       "   216,\n",
       "   217,\n",
       "   218,\n",
       "   219,\n",
       "   220,\n",
       "   221,\n",
       "   222]),\n",
       " ('n_uid',\n",
       "  [223,\n",
       "   224,\n",
       "   225,\n",
       "   226,\n",
       "   227,\n",
       "   228,\n",
       "   229,\n",
       "   230,\n",
       "   231,\n",
       "   232,\n",
       "   233,\n",
       "   234,\n",
       "   235,\n",
       "   236,\n",
       "   237,\n",
       "   238,\n",
       "   239,\n",
       "   240,\n",
       "   241,\n",
       "   242]),\n",
       " ('n_uid',\n",
       "  [243,\n",
       "   244,\n",
       "   245,\n",
       "   246,\n",
       "   247,\n",
       "   248,\n",
       "   249,\n",
       "   250,\n",
       "   251,\n",
       "   252,\n",
       "   253,\n",
       "   254,\n",
       "   255,\n",
       "   256,\n",
       "   257,\n",
       "   258,\n",
       "   259,\n",
       "   260,\n",
       "   261,\n",
       "   262]),\n",
       " ('n_uid',\n",
       "  [263,\n",
       "   264,\n",
       "   265,\n",
       "   266,\n",
       "   267,\n",
       "   268,\n",
       "   269,\n",
       "   270,\n",
       "   271,\n",
       "   272,\n",
       "   273,\n",
       "   274,\n",
       "   275,\n",
       "   276,\n",
       "   277,\n",
       "   278,\n",
       "   279,\n",
       "   280,\n",
       "   281,\n",
       "   282]),\n",
       " ('n_uid',\n",
       "  [283,\n",
       "   284,\n",
       "   285,\n",
       "   286,\n",
       "   287,\n",
       "   288,\n",
       "   289,\n",
       "   290,\n",
       "   291,\n",
       "   292,\n",
       "   293,\n",
       "   294,\n",
       "   295,\n",
       "   296,\n",
       "   297,\n",
       "   298,\n",
       "   299,\n",
       "   300,\n",
       "   301,\n",
       "   302]),\n",
       " ('n_uid',\n",
       "  [303,\n",
       "   304,\n",
       "   305,\n",
       "   306,\n",
       "   307,\n",
       "   308,\n",
       "   309,\n",
       "   310,\n",
       "   311,\n",
       "   312,\n",
       "   313,\n",
       "   314,\n",
       "   315,\n",
       "   316,\n",
       "   317,\n",
       "   318,\n",
       "   319,\n",
       "   320,\n",
       "   321,\n",
       "   322]),\n",
       " ('n_uid',\n",
       "  [323,\n",
       "   324,\n",
       "   325,\n",
       "   326,\n",
       "   327,\n",
       "   328,\n",
       "   329,\n",
       "   330,\n",
       "   331,\n",
       "   332,\n",
       "   333,\n",
       "   334,\n",
       "   335,\n",
       "   336,\n",
       "   337,\n",
       "   338,\n",
       "   339,\n",
       "   340,\n",
       "   341,\n",
       "   342]),\n",
       " ('n_uid',\n",
       "  [343,\n",
       "   344,\n",
       "   345,\n",
       "   346,\n",
       "   347,\n",
       "   348,\n",
       "   349,\n",
       "   350,\n",
       "   351,\n",
       "   352,\n",
       "   353,\n",
       "   354,\n",
       "   355,\n",
       "   356,\n",
       "   357,\n",
       "   358,\n",
       "   359,\n",
       "   360,\n",
       "   361,\n",
       "   362]),\n",
       " ('n_uid',\n",
       "  [363,\n",
       "   364,\n",
       "   365,\n",
       "   366,\n",
       "   367,\n",
       "   368,\n",
       "   369,\n",
       "   370,\n",
       "   371,\n",
       "   372,\n",
       "   373,\n",
       "   374,\n",
       "   375,\n",
       "   376,\n",
       "   377,\n",
       "   378,\n",
       "   379,\n",
       "   380,\n",
       "   381,\n",
       "   382]),\n",
       " ('n_uid',\n",
       "  [383,\n",
       "   384,\n",
       "   385,\n",
       "   386,\n",
       "   387,\n",
       "   388,\n",
       "   389,\n",
       "   390,\n",
       "   391,\n",
       "   392,\n",
       "   393,\n",
       "   394,\n",
       "   395,\n",
       "   396,\n",
       "   397,\n",
       "   398,\n",
       "   399,\n",
       "   400,\n",
       "   401,\n",
       "   402]),\n",
       " ('n_uid',\n",
       "  [403,\n",
       "   404,\n",
       "   405,\n",
       "   406,\n",
       "   407,\n",
       "   408,\n",
       "   409,\n",
       "   410,\n",
       "   411,\n",
       "   412,\n",
       "   413,\n",
       "   414,\n",
       "   415,\n",
       "   416,\n",
       "   417,\n",
       "   418,\n",
       "   419,\n",
       "   420,\n",
       "   421,\n",
       "   422]),\n",
       " ('n_uid',\n",
       "  [423,\n",
       "   424,\n",
       "   425,\n",
       "   426,\n",
       "   427,\n",
       "   428,\n",
       "   429,\n",
       "   430,\n",
       "   431,\n",
       "   432,\n",
       "   433,\n",
       "   434,\n",
       "   435,\n",
       "   436,\n",
       "   437,\n",
       "   438,\n",
       "   439,\n",
       "   440,\n",
       "   441,\n",
       "   442]),\n",
       " ('n_uid',\n",
       "  [443,\n",
       "   444,\n",
       "   445,\n",
       "   446,\n",
       "   447,\n",
       "   448,\n",
       "   449,\n",
       "   450,\n",
       "   451,\n",
       "   452,\n",
       "   453,\n",
       "   454,\n",
       "   455,\n",
       "   456,\n",
       "   457,\n",
       "   458,\n",
       "   459,\n",
       "   460,\n",
       "   461,\n",
       "   462]),\n",
       " ('n_conn_state', [463]),\n",
       " ('n_detailed-label', [464]),\n",
       " ('n_duration', [465]),\n",
       " ('n_history', [466]),\n",
       " ('n_id.orig_h', [467]),\n",
       " ('n_id.orig_p', [468]),\n",
       " ('n_id.resp_h', [469]),\n",
       " ('n_id.resp_p', [470]),\n",
       " ('n_label', [471]),\n",
       " ('n_missed_bytes', [472]),\n",
       " ('n_orig_bytes', [473]),\n",
       " ('n_orig_ip_bytes', [474]),\n",
       " ('n_orig_pkts', [475]),\n",
       " ('n_proto', [476]),\n",
       " ('n_resp_bytes', [477]),\n",
       " ('n_resp_ip_bytes', [478]),\n",
       " ('n_resp_pkts', [479]),\n",
       " ('n_service', [480]),\n",
       " ('n_ts', [481]),\n",
       " ('n_tunnel_parents', [482]),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_conn_state', []),\n",
       " ('n_detailed-label', []),\n",
       " ('n_duration', []),\n",
       " ('n_history', []),\n",
       " ('n_id.orig_h', []),\n",
       " ('n_id.orig_p', []),\n",
       " ('n_id.resp_h', []),\n",
       " ('n_id.resp_p', []),\n",
       " ('n_label', []),\n",
       " ('n_missed_bytes', []),\n",
       " ('n_orig_bytes', []),\n",
       " ('n_orig_ip_bytes', []),\n",
       " ('n_orig_pkts', []),\n",
       " ('n_proto', []),\n",
       " ('n_resp_bytes', []),\n",
       " ('n_resp_ip_bytes', []),\n",
       " ('n_resp_pkts', []),\n",
       " ('n_service', []),\n",
       " ('n_ts', []),\n",
       " ('n_tunnel_parents', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', []),\n",
       " ('n_uid', [])]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "generator.schema.type_adjacency_list(generator.head_node_types, len(num_samples))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "manual-walter",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'n_resp_ip_bytes': [EdgeType(n1='n_resp_ip_bytes', rel='e_resp_ip_bytes', n2='n_uid')],\n",
       " 'n_detailed-label': [EdgeType(n1='n_detailed-label', rel='e_detailed-label', n2='n_uid')],\n",
       " 'n_orig_pkts': [EdgeType(n1='n_orig_pkts', rel='e_orig_pkts', n2='n_uid')],\n",
       " 'n_tunnel_parents': [EdgeType(n1='n_tunnel_parents', rel='e_tunnel_parents', n2='n_uid')],\n",
       " 'n_id.orig_h': [EdgeType(n1='n_id.orig_h', rel='e_id.orig_h', n2='n_uid')],\n",
       " 'n_ts': [EdgeType(n1='n_ts', rel='e_ts', n2='n_uid')],\n",
       " 'n_missed_bytes': [EdgeType(n1='n_missed_bytes', rel='e_missed_bytes', n2='n_uid')],\n",
       " 'n_duration': [EdgeType(n1='n_duration', rel='e_duration', n2='n_uid')],\n",
       " 'n_uid': [EdgeType(n1='n_uid', rel='e_conn_state', n2='n_conn_state'),\n",
       "  EdgeType(n1='n_uid', rel='e_detailed-label', n2='n_detailed-label'),\n",
       "  EdgeType(n1='n_uid', rel='e_duration', n2='n_duration'),\n",
       "  EdgeType(n1='n_uid', rel='e_history', n2='n_history'),\n",
       "  EdgeType(n1='n_uid', rel='e_id.orig_h', n2='n_id.orig_h'),\n",
       "  EdgeType(n1='n_uid', rel='e_id.orig_p', n2='n_id.orig_p'),\n",
       "  EdgeType(n1='n_uid', rel='e_id.resp_h', n2='n_id.resp_h'),\n",
       "  EdgeType(n1='n_uid', rel='e_id.resp_p', n2='n_id.resp_p'),\n",
       "  EdgeType(n1='n_uid', rel='e_label', n2='n_label'),\n",
       "  EdgeType(n1='n_uid', rel='e_missed_bytes', n2='n_missed_bytes'),\n",
       "  EdgeType(n1='n_uid', rel='e_orig_bytes', n2='n_orig_bytes'),\n",
       "  EdgeType(n1='n_uid', rel='e_orig_ip_bytes', n2='n_orig_ip_bytes'),\n",
       "  EdgeType(n1='n_uid', rel='e_orig_pkts', n2='n_orig_pkts'),\n",
       "  EdgeType(n1='n_uid', rel='e_proto', n2='n_proto'),\n",
       "  EdgeType(n1='n_uid', rel='e_resp_bytes', n2='n_resp_bytes'),\n",
       "  EdgeType(n1='n_uid', rel='e_resp_ip_bytes', n2='n_resp_ip_bytes'),\n",
       "  EdgeType(n1='n_uid', rel='e_resp_pkts', n2='n_resp_pkts'),\n",
       "  EdgeType(n1='n_uid', rel='e_service', n2='n_service'),\n",
       "  EdgeType(n1='n_uid', rel='e_ts', n2='n_ts'),\n",
       "  EdgeType(n1='n_uid', rel='e_tunnel_parents', n2='n_tunnel_parents')],\n",
       " 'n_id.resp_h': [EdgeType(n1='n_id.resp_h', rel='e_id.resp_h', n2='n_uid')],\n",
       " 'n_id.resp_p': [EdgeType(n1='n_id.resp_p', rel='e_id.resp_p', n2='n_uid')],\n",
       " 'n_orig_bytes': [EdgeType(n1='n_orig_bytes', rel='e_orig_bytes', n2='n_uid')],\n",
       " 'n_resp_pkts': [EdgeType(n1='n_resp_pkts', rel='e_resp_pkts', n2='n_uid')],\n",
       " 'n_resp_bytes': [EdgeType(n1='n_resp_bytes', rel='e_resp_bytes', n2='n_uid')],\n",
       " 'n_service': [EdgeType(n1='n_service', rel='e_service', n2='n_uid')],\n",
       " 'n_history': [EdgeType(n1='n_history', rel='e_history', n2='n_uid')],\n",
       " 'n_label': [EdgeType(n1='n_label', rel='e_label', n2='n_uid')],\n",
       " 'n_proto': [EdgeType(n1='n_proto', rel='e_proto', n2='n_uid')],\n",
       " 'n_orig_ip_bytes': [EdgeType(n1='n_orig_ip_bytes', rel='e_orig_ip_bytes', n2='n_uid')],\n",
       " 'n_conn_state': [EdgeType(n1='n_conn_state', rel='e_conn_state', n2='n_uid')],\n",
       " 'n_id.orig_p': [EdgeType(n1='n_id.orig_p', rel='e_id.orig_p', n2='n_uid')]}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "generator.schema.schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "greater-serial",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "WARNING:tensorflow:AutoGraph could not transform <bound method MeanHinAggregator.call of <stellargraph.layer.hinsage.MeanHinAggregator object at 0x7f22784fc3a0>> and will run it as-is.\n",
      "Please report this to the TensorFlow team. When filing the bug, set the verbosity to 10 (on Linux, `export AUTOGRAPH_VERBOSITY=10`) and attach the full output.\n",
      "Cause: module 'gast' has no attribute 'Index'\n",
      "To silence this warning, decorate the function with @tf.autograph.experimental.do_not_convert\n",
      "WARNING: AutoGraph could not transform <bound method MeanHinAggregator.call of <stellargraph.layer.hinsage.MeanHinAggregator object at 0x7f22784fc3a0>> and will run it as-is.\n",
      "Please report this to the TensorFlow team. When filing the bug, set the verbosity to 10 (on Linux, `export AUTOGRAPH_VERBOSITY=10`) and attach the full output.\n",
      "Cause: module 'gast' has no attribute 'Index'\n",
      "To silence this warning, decorate the function with @tf.autograph.experimental.do_not_convert\n"
     ]
    }
   ],
   "source": [
    "hinsage_layer_sizes = [8, 8, 8]\n",
    "\n",
    "assert len(hinsage_layer_sizes) == len(num_samples)\n",
    "\n",
    "hinsage = HinSAGE(\n",
    "    layer_sizes=hinsage_layer_sizes, generator=generator, bias=True, dropout=0.0\n",
    ")\n",
    "\n",
    "x_inp, x_out = hinsage.in_out_tensors()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "honey-wayne",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "link_classification: using 'ip' method to combine node embeddings into edge embeddings\n",
      "WARNING:tensorflow:AutoGraph could not transform <bound method LinkEmbedding.call of <stellargraph.layer.link_inference.LinkEmbedding object at 0x7f22446fe940>> and will run it as-is.\n",
      "Please report this to the TensorFlow team. When filing the bug, set the verbosity to 10 (on Linux, `export AUTOGRAPH_VERBOSITY=10`) and attach the full output.\n",
      "Cause: module 'gast' has no attribute 'Index'\n",
      "To silence this warning, decorate the function with @tf.autograph.experimental.do_not_convert\n",
      "WARNING: AutoGraph could not transform <bound method LinkEmbedding.call of <stellargraph.layer.link_inference.LinkEmbedding object at 0x7f22446fe940>> and will run it as-is.\n",
      "Please report this to the TensorFlow team. When filing the bug, set the verbosity to 10 (on Linux, `export AUTOGRAPH_VERBOSITY=10`) and attach the full output.\n",
      "Cause: module 'gast' has no attribute 'Index'\n",
      "To silence this warning, decorate the function with @tf.autograph.experimental.do_not_convert\n"
     ]
    }
   ],
   "source": [
    "from stellargraph.layer import link_classification\n",
    "score_prediction = link_classification()(x_out)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "spiritual-mediterranean",
   "metadata": {},
   "outputs": [],
   "source": [
    "import tensorflow.keras.backend as K\n",
    "from tensorflow.keras import Model, optimizers, losses, metrics\n",
    "\n",
    "model = Model(inputs=x_inp, outputs=score_prediction)\n",
    "model.compile(\n",
    "    optimizer=optimizers.Adam(lr=1e-2),\n",
    "    loss=losses.BinaryCrossentropy(),\n",
    "    metrics=[metrics.BinaryAccuracy()]\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "specified-steal",
   "metadata": {},
   "outputs": [],
   "source": [
    "#model.summary()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "unsigned-smooth",
   "metadata": {},
   "outputs": [],
   "source": [
    "num_workers = 8\n",
    "\n",
    "test_metrics = model.evaluate(test_gen, verbose=1)\n",
    "\n",
    "print(\"Untrained model's Test Evaluation:\")\n",
    "for name, val in zip(model.metrics_names, test_metrics):\n",
    "    print(\"\\t{}: {:0.4f}\".format(name, val))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ignored-tumor",
   "metadata": {},
   "outputs": [],
   "source": [
    "epochs = 10\n",
    "\n",
    "history = model.fit(\n",
    "    train_gen,\n",
    "    validation_data=val_gen,\n",
    "    epochs=epochs,\n",
    "    verbose=1,\n",
    "    shuffle=False,\n",
    "    use_multiprocessing=False,\n",
    "    workers=num_workers,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "amended-consortium",
   "metadata": {},
   "outputs": [],
   "source": [
    "sg.utils.plot_history(history)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "green-applicant",
   "metadata": {},
   "outputs": [],
   "source": [
    "# save model\n",
    "\n",
    "import pickle\n",
    "pickle.dump(model, open('model.pkl', 'wb'), pickle.HIGHEST_PROTOCOL)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "baking-paraguay",
   "metadata": {},
   "outputs": [],
   "source": [
    "test_metrics = model.evaluate(\n",
    "    test_gen, use_multiprocessing=False, workers=num_workers, verbose=1\n",
    ")\n",
    "\n",
    "print(\"Test Evaluation:\")\n",
    "for name, val in zip(model.metrics_names, test_metrics):\n",
    "    print(\"\\t{}: {:0.4f}\".format(name, val))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "received-while",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "descending-empire",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "reliable-dover",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "prepared-security",
   "metadata": {},
   "outputs": [],
   "source": [
    "###########################################################################################################\n",
    "# ComplEx (NOT WORKING NOW!!!)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "faced-scale",
   "metadata": {},
   "outputs": [],
   "source": [
    "from stellargraph import datasets, utils\n",
    "from tensorflow.keras import callbacks, optimizers, losses, metrics, regularizers, Model\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "from stellargraph.mapper import KGTripleGenerator\n",
    "from stellargraph.layer import ComplEx\n",
    "\n",
    "from IPython.display import HTML"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "eleven-september",
   "metadata": {},
   "outputs": [],
   "source": [
    "epochs = 50\n",
    "embedding_dimension = 200\n",
    "negative_samples = 10\n",
    "batch_size = 50"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "loved-remedy",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Model: \"model\"\n",
      "__________________________________________________________________________________________________\n",
      "Layer (type)                    Output Shape         Param #     Connected to                     \n",
      "==================================================================================================\n",
      "input_1 (InputLayer)            [(None, 1)]          0                                            \n",
      "__________________________________________________________________________________________________\n",
      "input_2 (InputLayer)            [(None, 1)]          0                                            \n",
      "__________________________________________________________________________________________________\n",
      "input_3 (InputLayer)            [(None, 1)]          0                                            \n",
      "__________________________________________________________________________________________________\n",
      "embedding (Embedding)           (None, 1, 200)       172005400   input_1[0][0]                    \n",
      "                                                                 input_3[0][0]                    \n",
      "__________________________________________________________________________________________________\n",
      "embedding_1 (Embedding)         (None, 1, 200)       172005400   input_1[0][0]                    \n",
      "                                                                 input_3[0][0]                    \n",
      "__________________________________________________________________________________________________\n",
      "embedding_2 (Embedding)         (None, 1, 200)       8000        input_2[0][0]                    \n",
      "__________________________________________________________________________________________________\n",
      "embedding_3 (Embedding)         (None, 1, 200)       8000        input_2[0][0]                    \n",
      "__________________________________________________________________________________________________\n",
      "compl_ex_score (ComplExScore)   (None, 1)            0           embedding[0][0]                  \n",
      "                                                                 embedding_1[0][0]                \n",
      "                                                                 embedding_2[0][0]                \n",
      "                                                                 embedding_3[0][0]                \n",
      "                                                                 embedding[1][0]                  \n",
      "                                                                 embedding_1[1][0]                \n",
      "==================================================================================================\n",
      "Total params: 344,026,800\n",
      "Trainable params: 344,026,800\n",
      "Non-trainable params: 0\n",
      "__________________________________________________________________________________________________\n"
     ]
    }
   ],
   "source": [
    "hg_gen = KGTripleGenerator(\n",
    "    hetereogeneousGraph, batch_size=batch_size  # ~100 batches per epoch\n",
    ")\n",
    "\n",
    "hg_complex = ComplEx(\n",
    "    hg_gen,\n",
    "    embedding_dimension=embedding_dimension,\n",
    "    embeddings_regularizer=regularizers.l2(1e-7),\n",
    ")\n",
    "\n",
    "hg_inp, hg_out = hg_complex.in_out_tensors()\n",
    "\n",
    "hg_model = Model(inputs=hg_inp, outputs=hg_out)\n",
    "\n",
    "hg_model.compile(\n",
    "    optimizer=optimizers.Adam(lr=0.001),\n",
    "    loss=losses.BinaryCrossentropy(from_logits=True),\n",
    "    metrics=[metrics.BinaryAccuracy(threshold=0.0)],\n",
    ")\n",
    "\n",
    "hg_model.summary()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "rubber-dispute",
   "metadata": {},
   "outputs": [],
   "source": [
    "hg_train_gen = hg_gen.flow(\n",
    "    edges_train, negative_samples=negative_samples, shuffle=True\n",
    ")\n",
    "hg_valid_gen = hg_gen.flow(edges_val, negative_samples=negative_samples)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "double-stockholm",
   "metadata": {},
   "outputs": [],
   "source": [
    "wn18_es = callbacks.EarlyStopping(monitor=\"val_loss\", patience=10)\n",
    "wn18_history = wn18_model.fit(\n",
    "    hg_train_gen, validation_data=hg_valid_gen, epochs=epochs, callbacks=[wn18_es]\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "demographic-enhancement",
   "metadata": {},
   "outputs": [],
   "source": [
    "###########################################################################################################"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}